module.exports = {
  getTJData: function () {
    return {
      "date": "2018/7/2",
      "tuijian": [{
        "cid": "300700",
        "title": "岱勒新材",
        "star": "-1",
        "price": " 79.91"
      },
      {
        "cid": "603301",
        "title": "振德医疗",
        "star": " 2",
        "price": "788.05"
      },
      {
        "cid": "603773",
        "title": "沃格光电",
        "star": " 0",
        "price": " 24.79"
      },
      {
        "cid": "603897",
        "title": "长城科技",
        "star": " 2",
        "price": " 55.66"
      }]
    }
  },
  getSTData: function () {
    return {
      "603897": {
        "name": "长城科技",
        "level": [2, 4, 3, 1, 5, 5],
        "jbm": [{
          "index": "603897",
          "name": "长城科技",
          "code": "市盈率",
          "text": " 39.70000",
          "level": "3"
        },
        {
          "index": "603897",
          "name": "长城科技",
          "code": "市净率",
          "text": "  6.89000",
          "level": "1"
        },
        {
          "index": "603897",
          "name": "长城科技",
          "code": "净益率",
          "text": "  4.98000",
          "level": "5"
        },
        {
          "index": "603897",
          "name": "长城科技",
          "code": "净利润率",
          "text": "  3.75000",
          "level": "3"
        },
        {
          "index": "603897",
          "name": "长城科技",
          "code": "利润同比增长",
          "text": null,
          "level": "3"
        },
        {
          "index": "603897",
          "name": "长城科技",
          "code": "收入同比增长",
          "text": null,
          "level": "3"
        },
        {
          "index": "603897",
          "name": "长城科技",
          "code": "每股经营现金流",
          "text": "-12.46071",
          "level": "1"
        },
        {
          "index": "603897",
          "name": "长城科技",
          "code": "市销率",
          "text": "  6.92000",
          "level": "5"
        },
        {
          "index": "603897",
          "name": "长城科技",
          "code": "资产负债率",
          "text": " 39.56000",
          "level": "5"
        }]
      },
      "603773": {
        "name": "沃格光电",
        "level": [2.5, 5, 3, 5, 1, 4],
        "jbm": [{
          "index": "603773",
          "name": "沃格光电",
          "code": "市盈率",
          "text": "38.210000",
          "level": "4"
        },
        {
          "index": "603773",
          "name": "沃格光电",
          "code": "市净率",
          "text": " 8.320000",
          "level": "1"
        },
        {
          "index": "603773",
          "name": "沃格光电",
          "code": "净益率",
          "text": " 7.040000",
          "level": "5"
        },
        {
          "index": "603773",
          "name": "沃格光电",
          "code": "净利润率",
          "text": "33.600000",
          "level": "5"
        },
        {
          "index": "603773",
          "name": "沃格光电",
          "code": "利润同比增长",
          "text": null,
          "level": "3"
        },
        {
          "index": "603773",
          "name": "沃格光电",
          "code": "收入同比增长",
          "text": null,
          "level": "3"
        },
        {
          "index": "603773",
          "name": "沃格光电",
          "code": "每股经营现金流",
          "text": " 3.409529",
          "level": "5"
        },
        {
          "index": "603773",
          "name": "沃格光电",
          "code": "市销率",
          "text": "52.910000",
          "level": "1"
        },
        {
          "index": "603773",
          "name": "沃格光电",
          "code": "资产负债率",
          "text": "23.020000",
          "level": "4"
        }]
      },
      "603301": {
        "name": "振德医疗",
        "level": [2.5, 3, 3, 1, 3, 3],
        "jbm": [{
          "index": "603301",
          "name": "振德医疗",
          "code": "市盈率",
          "text": "55.28000",
          "level": "3"
        },
        {
          "index": "603301",
          "name": "振德医疗",
          "code": "市净率",
          "text": " 8.97000",
          "level": "2"
        },
        {
          "index": "603301",
          "name": "振德医疗",
          "code": "净益率",
          "text": " 3.40000",
          "level": "4"
        },
        {
          "index": "603301",
          "name": "振德医疗",
          "code": "净利润率",
          "text": " 7.04000",
          "level": "2"
        },
        {
          "index": "603301",
          "name": "振德医疗",
          "code": "利润同比增长",
          "text": null,
          "level": "3"
        },
        {
          "index": "603301",
          "name": "振德医疗",
          "code": "收入同比增长",
          "text": null,
          "level": "3"
        },
        {
          "index": "603301",
          "name": "振德医疗",
          "code": "每股经营现金流",
          "text": "-0.56384",
          "level": "1"
        },
        {
          "index": "603301",
          "name": "振德医疗",
          "code": "市销率",
          "text": "24.73000",
          "level": "3"
        },
        {
          "index": "603301",
          "name": "振德医疗",
          "code": "资产负债率",
          "text": "57.67000",
          "level": "3"
        }]
      },
      "300700": {
        "name": "岱勒新材",
        "level": [2.5, 5, 3, 5, 2, 3],
        "jbm": [{
          "index": "300700",
          "name": "岱勒新材",
          "code": "市盈率",
          "text": "38.2200000",
          "level": "4"
        },
        {
          "index": "300700",
          "name": "岱勒新材",
          "code": "市净率",
          "text": " 9.7000000",
          "level": "1"
        },
        {
          "index": "300700",
          "name": "岱勒新材",
          "code": "净益率",
          "text": " 7.1500000",
          "level": "5"
        },
        {
          "index": "300700",
          "name": "岱勒新材",
          "code": "净利润率",
          "text": "27.3000000",
          "level": "5"
        },
        {
          "index": "300700",
          "name": "岱勒新材",
          "code": "利润同比增长",
          "text": null,
          "level": "3"
        },
        {
          "index": "300700",
          "name": "岱勒新材",
          "code": "收入同比增长",
          "text": null,
          "level": "3"
        },
        {
          "index": "300700",
          "name": "岱勒新材",
          "code": "每股经营现金流",
          "text": " 0.4274048",
          "level": "5"
        },
        {
          "index": "300700",
          "name": "岱勒新材",
          "code": "市销率",
          "text": "37.0400000",
          "level": "2"
        },
        {
          "index": "300700",
          "name": "岱勒新材",
          "code": "资产负债率",
          "text": "47.0400000",
          "level": "3"
        }]
      }
    }
  },
  getZSData: function () {
    return {
      "data1": [-0.36, -2.23, -1.16, 0.26, -0.68, -3.86, -2.68],
      "data2": [4.0742, -1.6657, 1.2601, -1.6976, -1.362, -0.41258, 0.71311],
      "categories": ["第1周", "第2周", "第3周", "第4周", "第5周", "第6周", "第7周"],
      "jianyi": ["大盘震荡，适当参与", null, null, null, null, null, null],
      "zhishu": [4.3, null, null, null, null, null, null]
    }
  },
  getNEWSData: function () {
    return {
      "300700": [{
        "code": "300700",
        "date": "7月3日",
        "title": "岱勒新材7月3日加速下跌",
        "type": "公司新闻",
        "eva": "-0.4666667",
        "buy": "成交",
        "sell": "跌幅"
      },
      {
        "code": "300700",
        "date": "7月2日",
        "title": "解密主力资金出逃股 连续5日净流出270股",
        "type": "公司新闻",
        "eva": " 0.0000000",
        "buy": null,
        "sell": null
      },
      {
        "code": "300700",
        "date": "7月2日",
        "title": "近一年上市新股市场表现（7月2日）",
        "type": "公司新闻",
        "eva": " 1.0000000",
        "buy": "上涨",
        "sell": null
      },
      {
        "code": "300700",
        "date": "7月2日",
        "title": "岱勒新材7月2日快速上涨",
        "type": "公司新闻",
        "eva": " 1.0000000",
        "buy": "成交",
        "sell": null
      },
      {
        "code": "300700",
        "date": "7月2日",
        "title": "超20公司环保“事发” 建新股份治污5年未完成",
        "type": "公司新闻",
        "eva": "-1.0000000",
        "buy": null,
        "sell": "不能"
      }],
      "603773": [{
        "code": "603773",
        "date": "7月2日",
        "title": "沃格光电7月2日快速上涨",
        "type": "公司新闻",
        "eva": "1.0000000",
        "buy": "成交",
        "sell": null
      },
      {
        "code": "603773",
        "date": "7月2日",
        "title": "“深度参与”IPO VC_PE交出上半年成绩单",
        "type": "公司新闻",
        "eva": "1.0000000",
        "buy": "持股",
        "sell": null
      },
      {
        "code": "603773",
        "date": "7月1日",
        "title": "券商投行上半年成绩单抢鲜看！15大类榜单尽显头部效应",
        "type": "公司新闻",
        "eva": "0.4150943",
        "buy": "持股",
        "sell": "减少"
      },
      {
        "code": "603773",
        "date": "6月29日",
        "title": "沃格光电6月29日盘中涨幅达5%",
        "type": "公司新闻",
        "eva": "1.0000000",
        "buy": "成交",
        "sell": null
      },
      {
        "code": "603773",
        "date": "6月29日",
        "title": "6月29日江西板块涨幅达2%",
        "type": "公司新闻",
        "eva": "1.0000000",
        "buy": "成交",
        "sell": null
      }],
      "603897": [{
        "code": "603897",
        "date": "7月2日",
        "title": "新能源车概念走强 欣锐科技、蓝海华腾涨停",
        "type": "公司新闻",
        "eva": "1.0000000",
        "buy": "涨幅",
        "sell": null
      },
      {
        "code": "603897",
        "date": "7月2日",
        "title": "长城科技7月2日盘中涨幅达5%",
        "type": "公司新闻",
        "eva": "1.0000000",
        "buy": "成交",
        "sell": null
      },
      {
        "code": "603897",
        "date": "7月2日",
        "title": "长城科技7月2日快速上涨",
        "type": "公司新闻",
        "eva": "1.0000000",
        "buy": "成交",
        "sell": null
      },
      {
        "code": "603897",
        "date": "7月1日",
        "title": "券商投行上半年成绩单抢鲜看！15大类榜单尽显头部效应",
        "type": "公司新闻",
        "eva": "0.4150943",
        "buy": "持股",
        "sell": "减少"
      },
      {
        "code": "603897",
        "date": "6月27日",
        "title": "长城科技6月27日快速上涨",
        "type": "公司新闻",
        "eva": "1.0000000",
        "buy": "成交",
        "sell": null
      }],
      "603301": [{
        "code": "603301",
        "date": "7月3日",
        "title": "次新股活跃 春秋电子等6股涨停",
        "type": "公司新闻",
        "eva": " 0.0000000",
        "buy": null,
        "sell": null
      },
      {
        "code": "603301",
        "date": "7月1日",
        "title": "半年度盘点：次新股表现抢眼 74只浙股今年上涨",
        "type": "公司新闻",
        "eva": "-0.1428571",
        "buy": "上涨",
        "sell": "跌幅"
      },
      {
        "code": "603301",
        "date": "6月28日",
        "title": "振德医疗6月28日盘中跌幅达5%",
        "type": "公司新闻",
        "eva": " 0.1428571",
        "buy": "成交",
        "sell": "跌幅"
      },
      {
        "code": "603301",
        "date": "6月27日",
        "title": "2018年6月28日沪深股市交易提示",
        "type": "公司新闻",
        "eva": " 0.0000000",
        "buy": null,
        "sell": null
      },
      {
        "code": "603301",
        "date": "6月27日",
        "title": "次新股概念股近三日受16亿主力资金追捧",
        "type": "公司新闻",
        "eva": "-0.3548387",
        "buy": "成交",
        "sell": "下跌"
      }]
    }
  },
  getNoticeData: function () {
    return {
      "300700": [{
        "code": "300700",
        "date": "2018-06-28",
        "title": "岱勒新材：关于控股股东及实际控制人部分股份质押的公告",
        "type": "公司公告",
        "eva": " 1.0000000",
        "buy": "持股",
        "sell": null
      },
      {
        "code": "300700",
        "date": "2018-06-22",
        "title": "岱勒新材：关于收到长沙市环境保护局行政处罚决定的公告",
        "type": "公司公告",
        "eva": "-0.8347107",
        "buy": "投资",
        "sell": "不利"
      },
      {
        "code": "300700",
        "date": "2018-06-20",
        "title": "岱勒新材：关于公开发行可转换公司债券申请获得中国证监会受理的公告",
        "type": "公司公告",
        "eva": " 0.0000000",
        "buy": "投资",
        "sell": "风险"
      },
      {
        "code": "300700",
        "date": "2018-06-13",
        "title": "岱勒新材：第二届董事会第十六次会议决议公告",
        "type": "公司公告",
        "eva": " 0.3750000",
        "buy": "投资",
        "sell": "弃权"
      },
      {
        "code": "300700",
        "date": "2018-06-13",
        "title": "岱勒新材：独立董事关于公司第二届董事会第十六次会议相关事项的独立意见",
        "type": "公司公告",
        "eva": " 1.0000000",
        "buy": "投资",
        "sell": null
      },
      {
        "code": "300700",
        "date": "2018-06-13",
        "title": "岱勒新材：创业板公开发行可转换公司债券预案（修订稿）",
        "type": "公司公告",
        "eva": " 0.7408506",
        "buy": "不断",
        "sell": "不能"
      },
      {
        "code": "300700",
        "date": "2018-06-13",
        "title": "岱勒新材：创业板公开发行可转换公司债券募集资金项目可行性分析报告（修订稿）",
        "type": "公司公告",
        "eva": " 0.2475634",
        "buy": "不断",
        "sell": "风险"
      },
      {
        "code": "300700",
        "date": "2018-06-13",
        "title": "岱勒新材：创业板公开发行可转换公司债券的论证分析报告（修订稿）",
        "type": "公司公告",
        "eva": " 0.1270718",
        "buy": "不断",
        "sell": "不利"
      },
      {
        "code": "300700",
        "date": "2018-06-13",
        "title": "岱勒新材：关于调整公开发行可转换公司债券方案的公告",
        "type": "公司公告",
        "eva": " 1.0000000",
        "buy": "投资",
        "sell": null
      },
      {
        "code": "300700",
        "date": "2018-06-13",
        "title": "岱勒新材：关于创业板公开发行可转换公司债券摊薄即期回报对公司主要财务指标的影响及公司采取措施以及相关承诺（修订稿）的公告",
        "type": "公司公告",
        "eva": " 0.2554113",
        "buy": "不断",
        "sell": "不利"
      }],
      "603773": [{
        "code": "603773",
        "date": "2018-06-16",
        "title": "沃格光电关于参加2018年投资者集体接待日活动的公告",
        "type": "公司公告",
        "eva": " 0.0000000",
        "buy": null,
        "sell": null
      },
      {
        "code": "603773",
        "date": "2018-06-08",
        "title": "沃格光电关于全资子公司完成工商变更登记的公告",
        "type": "公司公告",
        "eva": " 0.0000000",
        "buy": null,
        "sell": null
      },
      {
        "code": "603773",
        "date": "2018-05-22",
        "title": "沃格光电投资者关系活动记录表",
        "type": "公司公告",
        "eva": " 0.9834711",
        "buy": "大幅",
        "sell": "下降"
      },
      {
        "code": "603773",
        "date": "2018-05-15",
        "title": "沃格光电关于变更投资者联系方式的公告",
        "type": "公司公告",
        "eva": " 0.0000000",
        "buy": null,
        "sell": null
      },
      {
        "code": "603773",
        "date": "2018-05-08",
        "title": "沃格光电关于完成工商变更登记的公告",
        "type": "公司公告",
        "eva": " 1.0000000",
        "buy": "投资",
        "sell": null
      },
      {
        "code": "603773",
        "date": "2018-05-04",
        "title": "沃格光电第二届董事会第十二次会议决议公告",
        "type": "公司公告",
        "eva": "-0.3333333",
        "buy": "增加",
        "sell": "弃权"
      },
      {
        "code": "603773",
        "date": "2018-05-04",
        "title": "沃格光电公司章程",
        "type": "公司公告",
        "eva": " 0.1719745",
        "buy": "成长",
        "sell": "不能"
      },
      {
        "code": "603773",
        "date": "2018-05-04",
        "title": "沃格光电关于增加注册资本及修改公司章程的公告",
        "type": "公司公告",
        "eva": " 1.0000000",
        "buy": "增加",
        "sell": null
      },
      {
        "code": "603773",
        "date": "2018-05-04",
        "title": "沃格光电关于对全资子公司增资的公告",
        "type": "公司公告",
        "eva": " 0.3333333",
        "buy": "投资",
        "sell": "风险"
      },
      {
        "code": "603773",
        "date": "2018-04-26",
        "title": "沃格光电股票交易异常波动公告",
        "type": "公司公告",
        "eva": " 0.3333333",
        "buy": "投资",
        "sell": "风险"
      }],
      "603897": [{
        "code": "603897",
        "date": "2018-06-07",
        "title": "长城科技关于全资子公司完成工商登记注册并取得营业执照的公告",
        "type": "公司公告",
        "eva": " 1.0000000",
        "buy": "投资",
        "sell": null
      },
      {
        "code": "603897",
        "date": "2018-05-31",
        "title": "长城科技第三届董事会第一次会议决议的公告",
        "type": "公司公告",
        "eva": "-0.5000000",
        "buy": "投资",
        "sell": "弃权"
      },
      {
        "code": "603897",
        "date": "2018-05-31",
        "title": "长城科技第三届监事会第一次会议决议的公告",
        "type": "公司公告",
        "eva": "-1.0000000",
        "buy": null,
        "sell": "弃权"
      },
      {
        "code": "603897",
        "date": "2018-05-31",
        "title": "长城科技独立董事关于第三届董事会第一次会议相关事项的独立意见",
        "type": "公司公告",
        "eva": " 0.0000000",
        "buy": null,
        "sell": null
      },
      {
        "code": "603897",
        "date": "2018-05-31",
        "title": "长城科技2018年第一次临时股东大会法律意见书",
        "type": "公司公告",
        "eva": " 1.0000000",
        "buy": "持有",
        "sell": null
      },
      {
        "code": "603897",
        "date": "2018-05-31",
        "title": "长城科技2018年第一次临时股东大会决议公告",
        "type": "公司公告",
        "eva": " 0.5000000",
        "buy": "持有",
        "sell": "弃权"
      },
      {
        "code": "603897",
        "date": "2018-05-31",
        "title": "长城科技关于对外投资设立全资子公司的公告",
        "type": "公司公告",
        "eva": " 0.3333333",
        "buy": "持有",
        "sell": "风险"
      },
      {
        "code": "603897",
        "date": "2018-05-24",
        "title": "长城科技2018年第一次临时股东大会会议资料",
        "type": "公司公告",
        "eva": " 0.0000000",
        "buy": null,
        "sell": null
      },
      {
        "code": "603897",
        "date": "2018-05-19",
        "title": "长城科技关于签订募集资金专户存储三方监管协议的公告",
        "type": "公司公告",
        "eva": " 1.0000000",
        "buy": "投资",
        "sell": null
      },
      {
        "code": "603897",
        "date": "2018-05-18",
        "title": "长城科技关于完成工商变更登记的公告",
        "type": "公司公告",
        "eva": " 0.0000000",
        "buy": null,
        "sell": null
      }],
      "603301": [{
        "code": "603301",
        "date": "2018-07-03",
        "title": "振德医疗关于使用部分闲置募集资金进行现金管理的进展公告",
        "type": "公司公告",
        "eva": " 0.3333333",
        "buy": "投资",
        "sell": "风险"
      },
      {
        "code": "603301",
        "date": "2018-06-29",
        "title": "振德医疗2018年第三次临时股东大会决议公告",
        "type": "公司公告",
        "eva": " 0.5000000",
        "buy": "持有",
        "sell": "弃权"
      },
      {
        "code": "603301",
        "date": "2018-06-29",
        "title": "振德医疗2018年第三次临时股东大会的法律意见书",
        "type": "公司公告",
        "eva": " 0.0000000",
        "buy": null,
        "sell": null
      },
      {
        "code": "603301",
        "date": "2018-06-28",
        "title": "振德医疗关于使用部分闲置募集资金进行现金管理的进展公告",
        "type": "公司公告",
        "eva": " 0.3333333",
        "buy": "投资",
        "sell": "风险"
      },
      {
        "code": "603301",
        "date": "2018-06-21",
        "title": "振德医疗2018年第三次临时股东大会会议材料",
        "type": "公司公告",
        "eva": " 0.0000000",
        "buy": null,
        "sell": null
      },
      {
        "code": "603301",
        "date": "2018-06-21",
        "title": "振德医疗关于政府有偿收回公司部分国有土地使用权及建筑物的进展公告",
        "type": "公司公告",
        "eva": " 0.0000000",
        "buy": null,
        "sell": null
      },
      {
        "code": "603301",
        "date": "2018-06-21",
        "title": "振德医疗关于参与竞买国有建设用地使用权的公告",
        "type": "公司公告",
        "eva": "-0.2500000",
        "buy": "投资",
        "sell": "风险"
      },
      {
        "code": "603301",
        "date": "2018-06-15",
        "title": "振德医疗关于政府有偿收回公司部分国有土地使用权及建筑物的进展公告",
        "type": "公司公告",
        "eva": " 0.0000000",
        "buy": null,
        "sell": null
      },
      {
        "code": "603301",
        "date": "2018-06-13",
        "title": "振德医疗第一届监事会第九次会议决议公告",
        "type": "公司公告",
        "eva": " 0.0000000",
        "buy": "投资",
        "sell": "弃权"
      },
      {
        "code": "603301",
        "date": "2018-06-13",
        "title": "振德医疗关于变更部分募投项目实施地点的公告",
        "type": "公司公告",
        "eva": " 0.5000000",
        "buy": "投资",
        "sell": "弃权"
      }]
    }
  },
  getReportData: function () {
    return {
      "300700": [{
        "code": "300700",
        "organization": "国海证券",
        "grade": "买入",
        "date": "2018-02-27",
        "title": "深度报告：光伏+蓝宝石双轮驱动，公司发展步入机遇期",
        "type": "个股研报"
      },
      {
        "code": "300700",
        "organization": "中泰证券",
        "grade": "增持",
        "date": "2017-12-12",
        "title": "国内领先的金刚石线制造商，产能扩张带来持续增长",
        "type": "个股研报"
      },
      {
        "code": "300700",
        "organization": "国海证券",
        "grade": "增持",
        "date": "2017-11-21",
        "title": "动态研究：金刚石线切割前景广阔，公司发展有望充分受益",
        "type": "个股研报"
      },
      {
        "code": "300700",
        "organization": "中信建投证券",
        "grade": "Null",
        "date": "2017-08-22",
        "title": "中小公司新股研究（第96期）：岱勒新材",
        "type": "个股研报"
      }],
      "603773": [{
        "code": "603773",
        "organization": "东莞证券",
        "grade": "Null",
        "date": "2018-03-27",
        "title": "新股网下申购询价建议报告（沃格光电）",
        "type": "个股研报"
      }],
      "603301": [{
        "code": "603301",
        "organization": "财通证券",
        "grade": "Null",
        "date": "2018-04-13",
        "title": "医用敷料行业龙头企业",
        "type": "个股研报"
      },
      {
        "code": "603301",
        "organization": "恒泰证券",
        "grade": "Null",
        "date": "2018-04-02",
        "title": "新股申购：预计上市初期压力位53元-60元",
        "type": "个股研报"
      },
      {
        "code": "603301",
        "organization": "东莞证券",
        "grade": "Null",
        "date": "2018-03-22",
        "title": "新股网下申购询价建议报告（振德医疗）",
        "type": "个股研报"
      }]
    }
  }
}

